#Задание 2.2
#считать с клавиатуры произвольную строку
name = input ("введите имя: ")
print(f'привет, {name} !')